Catalogs/ПравилаОбработкиВходящихПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПравилаОбработкиВходящихПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетРазбораТекста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник_Статичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьEmailОтправителяКакEmailКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеАдресаОтправителей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлектроннаяПочтаОтправителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТемаПисьмаСЗаявкой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекстПисьмаСЗаявкой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеПоля_ИмяКлиента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзЗначенияИсключатьПодстроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейНепустойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеПоля_ТелефонКлиента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзЗначенияИсключатьПодстроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейНепустойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеПоля_EmailКлиента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзЗначенияИсключатьПодстроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейНепустойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеПоля_НазваниеАкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзЗначенияИсключатьПодстроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейНепустойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеПоля_РекламныйИсточник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзЗначенияИсключатьПодстроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейНепустойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеПоля_ID</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзЗначенияИсключатьПодстроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейНепустойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РекламныеИсточникиПоАдресуОтправителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлектронныйАдресОтправителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекламныйИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСвойстваЛида</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДополнительныхСвойствЛида</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзЗначенияИсключатьПодстроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНаСледующейНепустойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПравилаОбработкиВходящихПисем/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ДобавитьПодсказкуВводаДляТабличнойЧасти("ЭлектронныеАдресаОтправителей");
	ДобавитьПодсказкуВводаДляТабличнойЧасти("ТемаПисьмаСЗаявкой");
	ДобавитьПодсказкуВводаДляТабличнойЧасти("ТекстПисьмаСЗаявкой");
	
	//#16335
	Элементы.СтраницаПодразделение.Видимость = ЗначениеЗаполнено(Объект.Подразделение)
	                                          ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Объект.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя
		И НЕ Объект.РекламныйИсточник_Статичный
		И НЕ Объект.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма Тогда
		УстановитьСпособЗаполненияРекламногоИсточника();
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УдалитьПодсказкуВводаДляТабличнойЧасти("ЭлектронныеАдресаОтправителей");
	УдалитьПодсказкуВводаДляТабличнойЧасти("ТемаПисьмаСЗаявкой");
	УдалитьПодсказкуВводаДляТабличнойЧасти("ТекстПисьмаСЗаявкой");
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДобавитьПодсказкуВводаДляТабличнойЧасти("ЭлектронныеАдресаОтправителей");
	ДобавитьПодсказкуВводаДляТабличнойЧасти("ТемаПисьмаСЗаявкой");
	ДобавитьПодсказкуВводаДляТабличнойЧасти("ТекстПисьмаСЗаявкой");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

//&НаКлиенте
//Процедура АвтоматическиАнализироватьТекстПисьмаСЗаявкойПриИзменении(Элемент)
//	
//	УправлениеФормой();
//	
//КонецПроцедуры

&НаКлиенте
Процедура РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителяПриИзменении(Элемент)
	УстановитьСпособЗаполненияРекламногоИсточника(Истина, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РекламныйИсточник_СтатичныйПриИзменении(Элемент)
	УстановитьСпособЗаполненияРекламногоИсточника(Ложь, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьмаПриИзменении(Элемент)
	УстановитьСпособЗаполненияРекламногоИсточника(Ложь, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНаСледующейСтрокеПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекущиеДанные.ЗначениеНаСледующейСтроке Тогда
		ТекущиеДанные.ЗначениеНаСледующейНепустойСтроке = Ложь;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНаСледующейНепустойСтрокеПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекущиеДанные.ЗначениеНаСледующейНепустойСтроке Тогда
		ТекущиеДанные.ЗначениеНаСледующейСтроке = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеАдресаОтправителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	УдалитьПодсказкуВводаДляТабличнойЧасти("ЭлектронныеАдресаОтправителей");
		
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеАдресаОтправителейПослеУдаления(Элемент)

	ДобавитьПодсказкуВводаДляТабличнойЧасти("ЭлектронныеАдресаОтправителей");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПисьмаСЗаявкойПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	УдалитьПодсказкуВводаДляТабличнойЧасти("ТекстПисьмаСЗаявкой");
		
КонецПроцедуры

&НаКлиенте
Процедура ТекстПисьмаСЗаявкойПослеУдаления(Элемент)

	ДобавитьПодсказкуВводаДляТабличнойЧасти("ТекстПисьмаСЗаявкой");
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаПисьмаСЗаявкойПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	УдалитьПодсказкуВводаДляТабличнойЧасти("ТемаПисьмаСЗаявкой");
		
КонецПроцедуры

&НаКлиенте
Процедура ТемаПисьмаСЗаявкойПослеУдаления(Элемент)

	ДобавитьПодсказкуВводаДляТабличнойЧасти("ТемаПисьмаСЗаявкой");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЭлектронныеАдресаОтправителей.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ЭлектронныеАдресаОтправителей.СтрокаПодсказкиВвода");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(153, 153, 153)); // серый
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТемаПисьмаСЗаявкой.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ТемаПисьмаСЗаявкой.СтрокаПодсказкиВвода");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(153, 153, 153)); // серый
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекстПисьмаСЗаявкой.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ТекстПисьмаСЗаявкой.СтрокаПодсказкиВвода");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(153, 153, 153)); // серый
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.ПриоритетТекста.Видимость = Истина; //Объект.АвтоматическиАнализироватьТекстПисьмаСЗаявкой;
	Элементы.ГруппаПравилаРазбораПисьмаСтраницы.Видимость = Истина; //Объект.АвтоматическиАнализироватьТекстПисьмаСЗаявкой;

	Элементы.ГруппаРИПоНаименованиюПоПолюПисьма.Видимость = Ложь;
	Элементы.ГруппаРИПоЭлектроннойПочтеОтправителя.Видимость = Ложь;
	Элементы.ГруппаРИСтатичный.Видимость = Ложь;
	Если Объект.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя Тогда
		Элементы.ГруппаРИПоЭлектроннойПочтеОтправителя.Видимость = Истина;
	ИначеЕсли Объект.РекламныйИсточник_Статичный Тогда
		Элементы.ГруппаРИСтатичный.Видимость = Истина;
	ИначеЕсли Объект.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма Тогда
		Элементы.ГруппаРИПоНаименованиюПоПолюПисьма.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпособЗаполненияРекламногоИсточника(Знач РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя = Ложь, Знач РекламныйИсточник_Статичный = Ложь, Знач РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма = Ложь)
	
	Если НЕ РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя
		И НЕ РекламныйИсточник_Статичный
		И НЕ РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма
	Тогда
		Объект.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя = Ложь;
		Объект.РекламныйИсточник_Статичный = Ложь;
		Объект.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма = Истина;
	ИначеЕсли РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя Тогда
		Объект.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя = Истина;
		Объект.РекламныйИсточник_Статичный = Ложь;
		Объект.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма = Ложь;
	ИначеЕсли  РекламныйИсточник_Статичный Тогда
		Объект.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя = Ложь;
		Объект.РекламныйИсточник_Статичный = Истина;
		Объект.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма = Ложь;
	ИначеЕсли  РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма Тогда
		Объект.РекламныйИсточник_ЗависитОтЭлектроннойПочтыОтправителя = Ложь;
		Объект.РекламныйИсточник_Статичный = Ложь;
		Объект.РекламныйИсточник_ПоискПоНаименованиюИзСоответствующегоПоляПисьма = Истина;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодсказкуВводаДляТабличнойЧасти(ИмяТЧ)
	
	Если ИмяТЧ = "ЭлектронныеАдресаОтправителей" Тогда
		ИмяРеквизита = "ЭлектроннаяПочтаОтправителя";
		ТекстПодсказки = "Все получатели";
	ИначеЕсли ИмяТЧ = "ТемаПисьмаСЗаявкой" Тогда
		ИмяРеквизита = "Текст";
		ТекстПодсказки = "Любая тема письма";
	ИначеЕсли ИмяТЧ = "ТекстПисьмаСЗаявкой" Тогда
		ИмяРеквизита = "Текст";
		ТекстПодсказки = "Любой текст письма";
	КонецЕсли;
	
	Если Объект[ИмяТЧ].Количество() = 0 Тогда
		НоваяСтрока = Объект[ИмяТЧ].Добавить();	
		НоваяСтрока[ИмяРеквизита] = ТекстПодсказки;
		НоваяСтрока.СтрокаПодсказкиВвода = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьПодсказкуВводаДляТабличнойЧасти(ИмяТЧ)
	
	Если Объект[ИмяТЧ].Количество() > 0 Тогда
		Если Объект[ИмяТЧ][0].СтрокаПодсказкиВвода Тогда
			Объект[ИмяТЧ].Удалить(0);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
